In [1]:
import sqlite3

In [2]:
import pandas as pd

# Sakila Sample Database

This project will use Mike Hillye's [Sakila sample database](https://dev.mysql.com/doc/sakila/en). This specific database is basically a mock rental video chain database that is commonly used as a tutorial database for learning MySQL. With this project though, it will be used to practice basic ways to use Pandas in Python to work with a SQL database.

SQLite 3, a [self-contained, serverless, zero-configuration, transactional SQL database engine](https://sqlite.org/about.html), will be used to work with the Sakila database. Python’s built-in SQLite3 module easily allows for working within this simple disk-based database. The project will likely evolve as new things are learned and new practice is done but, to start off the project, there will be practice putting SQL SELECT, SQL DISTINCT, SQL WHERE, SQL AND, and SQL OR syntax to use. Those examples will be kept simple in that they will just be used to access the Sakila database and set queries as DataFrames in Pandas. 

Prior to that, there will be a necessary first step for using the module - creating a connection to the database. To begin, a connection object representing the database will be created below. That will be done by using the “sqlite3.connect()” command. The database sits in the same folder as this project does, so no path will be required/given - only the database file’s name.

In [3]:
connection = sqlite3.connect("sakila.db")

Next, Pandas will be used to pass a SQL query (using the connection from SQLite 3) and then return a DataFrame. The function for doing that will be set to “sqlDataFrame” - a DataFrame that will be used throughout the project. 

Specifically, “sqlDataFrame” will be set as the SQL to Pandas (a function for taking in a SQL query). The function will use “pd.read_sql()” to: 

	1) take in that query 
	
	   and also 

	2) use the connection made earlier (“connection”) to set that query as a DataFrame. 

Then, it will return the resulting DataFrame.

In [4]:
def sqlDataFrame(sqlQuery):

    dataFrame = pd.read_sql(sqlQuery, connection)

    return dataFrame

To run a basic SQL query using Pandas, commands can be given by setting an object as a multiline string. 

Even though not all versions of SQL require that commands be given in all caps, for safety and standardization, the commands in this project will be given in all caps.

Below, the query will SELECT everything ("*") from the "category" table for checking the different types of mock movies that are contained in the collection. A semicolon will end the query.

In [5]:
genresQuery = ''' SELECT * 
                  FROM category; '''

Next, Pandas will be used to pass the SQL query using the "genresQuery" SQL query object. The connection will be passed too, and both with be set to the resulting DataFrame "genreDataFrame".

In [6]:
genreDataFrame = pd.read_sql(genresQuery, connection)

In [7]:
genreDataFrame   # ... to view the DataFrame containing the "category" table result set.

    category_id         name              last_update
0             1       Action  2006-02-15 04:46:27.000
1             2    Animation  2006-02-15 04:46:27.000
2             3     Children  2006-02-15 04:46:27.000
3             4     Classics  2006-02-15 04:46:27.000
4             5       Comedy  2006-02-15 04:46:27.000
5             6  Documentary  2006-02-15 04:46:27.000
6             7        Drama  2006-02-15 04:46:27.000
7             8       Family  2006-02-15 04:46:27.000
8             9      Foreign  2006-02-15 04:46:27.000
9            10        Games  2006-02-15 04:46:27.000
10           11       Horror  2006-02-15 04:46:27.000
11           12        Music  2006-02-15 04:46:27.000
12           13          New  2006-02-15 04:46:27.000
13           14       Sci-Fi  2006-02-15 04:46:27.000
14           15       Sports  2006-02-15 04:46:27.000
15           16       Travel  2006-02-15 04:46:27.000

Below, a similar display process will be done by using the "sqlDataFrame" DataFrame instead. The simpler method below will be used for the remaining database practice work in this project.

In [8]:
sqlDataFrame(genresQuery)

    category_id         name              last_update
0             1       Action  2006-02-15 04:46:27.000
1             2    Animation  2006-02-15 04:46:27.000
2             3     Children  2006-02-15 04:46:27.000
3             4     Classics  2006-02-15 04:46:27.000
4             5       Comedy  2006-02-15 04:46:27.000
5             6  Documentary  2006-02-15 04:46:27.000
6             7        Drama  2006-02-15 04:46:27.000
7             8       Family  2006-02-15 04:46:27.000
8             9      Foreign  2006-02-15 04:46:27.000
9            10        Games  2006-02-15 04:46:27.000
10           11       Horror  2006-02-15 04:46:27.000
11           12        Music  2006-02-15 04:46:27.000
12           13          New  2006-02-15 04:46:27.000
13           14       Sci-Fi  2006-02-15 04:46:27.000
14           15       Sports  2006-02-15 04:46:27.000
15           16       Travel  2006-02-15 04:46:27.000

It is possible to select multiple columns. To do that as practice here, an object named “stockQuery” will be made with SQL syntax passed through it. The command will have it SELECT the “rental_date”, “return_date”, and “last_update” columns from the “rental” table. A semicolon will end this query as usual.

In [9]:
stockQuery = ''' SELECT rental_date, return_date, last_update 
                 FROM rental; '''

In [10]:
sqlDataFrame(stockQuery).head()

               rental_date              return_date          last_update
0  2005-05-24 22:53:30.000  2005-05-26 22:04:30.000  2011-09-14 18:10:44
1  2005-05-24 22:54:33.000  2005-05-28 19:40:33.000  2011-09-14 18:10:44
2  2005-05-24 23:03:39.000  2005-06-01 22:12:39.000  2011-09-14 18:10:44
3  2005-05-24 23:04:41.000  2005-06-03 01:43:41.000  2011-09-14 18:10:44
4  2005-05-24 23:05:21.000  2005-06-02 04:33:21.000  2011-09-14 18:10:44

Next, a check will be done to see how many language options are available for the mock movies in the collection. To do that, the DISTINCT keyword will be used to return only distinct/unique “language_ids” from the “language” table.

In [11]:
languageQuery = ''' SELECT DISTINCT(language_id)
                    FROM language; '''

In [12]:
sqlDataFrame(languageQuery)   # Taking a look at the result

   language_id
0            1
1            2
2            3
3            4
4            5
5            6

A check will be done below to see which customers have spent at least $10 with the rental chain. To do that, the WHERE clause will be used to filter through the “payment” table to find customers who have spent an “amount” greater than or equal to “10”.

In [13]:
spendQuery = ''' SELECT *
                 FROM payment
                 WHERE amount >= 10; '''

In [14]:
sqlDataFrame(spendQuery).tail(1)   # Looking at the tail end to see the amount of customers

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
113,15947,595,2,9826,10.99,2005-07-31 11:51:46.000,2011-09-14 18:31:34

Next, to practice filtering using more than one condition, the AND operator will be used to SELECT every ("*") "film" within the chain's collection of the "release_year" “2006” that has a "rating" of “PG”.

In [15]:
pgQuery = ''' SELECT *
              FROM film
              WHERE release_year = 2006
              AND rating = "PG"; '''

In [16]:
sqlDataFrame(pgQuery).tail(1)   # Looking at the tail end to see the number of 2006 PG movies

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
193,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,2006,1,None,4,2.99,185,26.99,PG,"Deleted Scenes,Behind the Scenes",2011-09-14 18:05:56

In a similar filtering process as above (i.e. - scanning through the table while looking for two conditions in weighing whether to return a record) below, the object will be set to display a record if either of two conditions are true. Specifically, the “adultQuery” object will be set to SELECT all ("*") films from the “film” table that are rated “R” or “NC-17”, to find the more mature movies in the mock rental chain’s system.

In [17]:
matureQuery = ''' SELECT *
                  FROM film
                  WHERE rating = "R"
                  OR rating = "NC-17"; '''

In [18]:
sqlDataFrame(matureQuery).tail(1)   # Looking at the tail end to see the number of adult movies

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
404,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,None,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2011-09-14 18:05:56

Next, the aggregate function COUNT will be used to return the number of customers that the mock rental chain has. To do that, a query called “customerQuery” will be set to SELECT the “customer_id” information contained in the “customer” table for counting the number of rows in that table.

In [19]:
customerQuery = ''' SELECT COUNT(customer_id)
                    FROM customer; '''

In [20]:
sqlDataFrame(customerQuery)   # Seeing how many customers there are.

   COUNT(customer_id)
0                 599

Next, all of the mock movies in the “film” table that are rated either “PG” or “PG-13” will be found and tallied. The SQL LIKE operator will be used because the “%” wildcard character will be given in the WHERE clause. When a substitute like that (i.e. - either the “_”, “%”, or [character_list] wildcards) are used, the LIKE operator is needed to support it.

In [21]:
pg13Qquery = ''' SELECT *
                 FROM film
                 WHERE rating LIKE "PG%"; '''

In [22]:
sqlDataFrame(pg13Qquery).tail(1)   # Looking at the tail end to see the number of those movies

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
416,994,WYOMING STORM,A Awe-Inspiring Panorama of a Robot And a Boat...,2006,1,None,6,4.99,100,29.99,PG-13,Deleted Scenes,2011-09-14 18:05:56

The "_" wildcard substitutes for a single character. It will be used below to search using postal codes to find customers whose addresses are in a certain area. Specifically, the "address" table will be scanned for "postal_code" values that are either "69220", "69221", "69222", "69223", "69224", "69225", "69226", "69227", "69228", or "69229".

In [23]:
directMailQuery = ''' SELECT *
                      FROM address
                      WHERE postal_code LIKE "6922_"; '''

In [24]:
sqlDataFrame(directMailQuery)

,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,62,1114 Liepaja Street,None,,282,69226,,2011-09-14 18:05:17
1,478,1078 Stara Zagora Drive,None,,301,69221,,2011-09-14 18:05:25

Next, all mock movies that have either “Deleted Scenes” or “Behind the Scenes” content as special features will be found. To do that, the “film” table will be scanned and the “special_features” column will be checked for movies with those two ranges of characters. 

Putting the character_list operator to use with SQLite does not work in the same way that it does when using that wildcard with other SQL formats (like MySQL, for example). Accordingly, instead of using the LIKE operator, GLOB will be used to support this task in SQL with Python, Pandas, and SQLite. Then, the character list will follow, passed as a combined string containing both features - “[Deleted ScenesBehind the Scenes]”.

In [25]:
extrasQuery = ''' SELECT *
                  FROM film
                  WHERE special_features GLOB "[Deleted ScenesBehind the Scenes]*"; '''

In [26]:
sqlDataFrame(extrasQuery).tail(3)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
199,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,2006,1,None,4,2.99,185,26.99,PG,"Deleted Scenes,Behind the Scenes",2011-09-14 18:05:56
200,994,WYOMING STORM,A Awe-Inspiring Panorama of a Robot And a Boat...,2006,1,None,6,4.99,100,29.99,PG-13,Deleted Scenes,2011-09-14 18:05:56
201,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,None,6,0.99,105,10.99,NC-17,Deleted Scenes,2011-09-14 18:05:56

Below, SQL ORDER BY will be used for a simple query within which, customer last names will be  ordered alphabetically.

In [27]:
nameQuery = ''' SELECT *
                FROM customer
                ORDER BY last_name; '''

In [28]:
sqlDataFrame(nameQuery)[0:20]   # Viewing a sample of the results.

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,505,1,RAFAEL,ABNEY,RAFAEL.ABNEY@sakilacustomer.org,510,1,2006-02-14 22:04:37.000,2011-09-14 18:10:42
1,504,1,NATHANIEL,ADAM,NATHANIEL.ADAM@sakilacustomer.org,509,1,2006-02-14 22:04:37.000,2011-09-14 18:10:42
2,36,2,KATHLEEN,ADAMS,KATHLEEN.ADAMS@sakilacustomer.org,40,1,2006-02-14 22:04:36.000,2011-09-14 18:10:29
3,96,1,DIANA,ALEXANDER,DIANA.ALEXANDER@sakilacustomer.org,100,1,2006-02-14 22:04:36.000,2011-09-14 18:10:30
4,470,1,GORDON,ALLARD,GORDON.ALLARD@sakilacustomer.org,475,1,2006-02-14 22:04:37.000,2011-09-14 18:10:41
5,27,2,SHIRLEY,ALLEN,SHIRLEY.ALLEN@sakilacustomer.org,31,1,2006-02-14 22:04:36.000,2011-09-14 18:10:29
6,220,2,CHARLENE,ALVAREZ,CHARLENE.ALVAREZ@sakilacustomer.org,224,1,2006-02-14 22:04:36.000,2011-09-14 18:10:34
7,11,2,LISA,ANDERSON,LISA.ANDERSON@sakilacustomer.org,15,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
8,326,1,JOSE,ANDREW,JOSE.ANDREW@sakilacustomer.org,331,1,2006-02-14 22:04:37.000,2011-09-14 18:10:37
9,183,2,IDA,ANDREWS,IDA.ANDREWS@sakilacustomer.org,187,1,2006-02-14 22:04:36.000,2011-09-14 18:10:32
10,449,2,OSCAR,AQUINO,OSCAR.AQUINO@sakilacustomer.org,454,1,2006-02-14 22:04:37.000,2011-09-14 18:10:41
11,368,1,HARRY,ARCE,HARRY.ARCE@sakilacustomer.org,373,0,2006-02-14 22:04:37.000,2011-09-14 18:10:38
12,560,1,JORDAN,ARCHULETA,JORDAN.ARCHULETA@sakilacustomer.org,566,1,2006-02-14 22:04:37.000,2011-09-14 18:10:43
13,188,1,MELANIE,ARMSTRONG,MELANIE.ARMSTRONG@sakilacustomer.org,192,1,2006-02-14 22:04:36.000,2011-09-14 18:10:32
14,170,1,BEATRICE,ARNOLD,BEATRICE.ARNOLD@sakilacustomer.org,174,1,2006-02-14 22:04:36.000,2011-09-14 18:10:32
15,591,1,KENT,ARSENAULT,KENT.ARSENAULT@sakilacustomer.org,597,1,2006-02-14 22:04:37.000,2011-09-14 18:10:44
16,345,1,CARL,ARTIS,CARL.ARTIS@sakilacustomer.org,350,1,2006-02-14 22:04:37.000,2011-09-14 18:10:38
17,530,2,DARRYL,ASHCRAFT,DARRYL.ASHCRAFT@sakilacustomer.org,536,1,2006-02-14 22:04:37.000,2011-09-14 18:10:43
18,540,1,TYRONE,ASHER,TYRONE.ASHER@sakilacustomer.org,546,1,2006-02-14 22:04:37.000,2011-09-14 18:10:43
19,196,1,ALMA,AUSTIN,ALMA.AUSTIN@sakilacustomer.org,200,1,2006-02-14 22:04:36.000,2011-09-14 18:10:32

The same query as above will be done next, but with the names returned in descending alphabetical order instead. The DESC keyword will be used to indicate that shift in arrangement.

In [29]:
descNameQuery = ''' SELECT *
                    FROM customer
                    ORDER BY last_name DESC; '''

In [30]:
sqlDataFrame(descNameQuery)[0:20]

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,28,1,CYNTHIA,YOUNG,CYNTHIA.YOUNG@sakilacustomer.org,32,1,2006-02-14 22:04:36.000,2011-09-14 18:10:29
1,413,2,MARVIN,YEE,MARVIN.YEE@sakilacustomer.org,418,1,2006-02-14 22:04:37.000,2011-09-14 18:10:40
2,402,1,LUIS,YANEZ,LUIS.YANEZ@sakilacustomer.org,407,1,2006-02-14 22:04:37.000,2011-09-14 18:10:39
3,318,1,BRIAN,WYMAN,BRIAN.WYMAN@sakilacustomer.org,323,1,2006-02-14 22:04:37.000,2011-09-14 18:10:37
4,31,2,BRENDA,WRIGHT,BRENDA.WRIGHT@sakilacustomer.org,35,1,2006-02-14 22:04:36.000,2011-09-14 18:10:29
5,496,2,TYLER,WREN,TYLER.WREN@sakilacustomer.org,501,1,2006-02-14 22:04:37.000,2011-09-14 18:10:42
6,107,1,FLORENCE,WOODS,FLORENCE.WOODS@sakilacustomer.org,111,1,2006-02-14 22:04:36.000,2011-09-14 18:10:30
7,78,1,LORI,WOOD,LORI.WOOD@sakilacustomer.org,82,1,2006-02-14 22:04:36.000,2011-09-14 18:10:30
8,581,1,VIRGIL,WOFFORD,VIRGIL.WOFFORD@sakilacustomer.org,587,1,2006-02-14 22:04:37.000,2011-09-14 18:10:44
9,541,2,DARREN,WINDHAM,DARREN.WINDHAM@sakilacustomer.org,547,1,2006-02-14 22:04:37.000,2011-09-14 18:10:43
10,8,2,SUSAN,WILSON,SUSAN.WILSON@sakilacustomer.org,12,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
11,172,1,BERNICE,WILLIS,BERNICE.WILLIS@sakilacustomer.org,176,1,2006-02-14 22:04:36.000,2011-09-14 18:10:32
12,213,1,GINA,WILLIAMSON,GINA.WILLIAMSON@sakilacustomer.org,217,1,2006-02-14 22:04:36.000,2011-09-14 18:10:33
13,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
14,455,2,JON,WILES,JON.WILES@sakilacustomer.org,460,1,2006-02-14 22:04:37.000,2011-09-14 18:10:41
15,363,2,ROY,WHITING,ROY.WHITING@sakilacustomer.org,368,1,2006-02-14 22:04:37.000,2011-09-14 18:10:38
16,14,2,BETTY,WHITE,BETTY.WHITE@sakilacustomer.org,18,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
17,208,1,LUCY,WHEELER,LUCY.WHEELER@sakilacustomer.org,212,1,2006-02-14 22:04:36.000,2011-09-14 18:10:33
18,369,2,FRED,WHEAT,FRED.WHEAT@sakilacustomer.org,374,1,2006-02-14 22:04:37.000,2011-09-14 18:10:38
19,520,2,MITCHELL,WESTMORELAND,MITCHELL.WESTMORELAND@sakilacustomer.org,526,1,2006-02-14 22:04:37.000,2011-09-14 18:10:42

Next, SQL GROUP BY will be used with an aggregate function to group the results of customer counts by store. To do that, the query “custCountQuery” will be set up to SELECT the “store_id” column then COUNT the number of customers by calling the “customer_id” column FROM the “customer” table. After that, everything will be grouped by “store_id”.

In [31]:
custCountQuery = ''' SELECT store_id, COUNT(customer_id)
                     FROM customer
                     GROUP BY store_id; '''

In [32]:
sqlDataFrame(custCountQuery)   # ... to view the number of customers per store.

   store_id  COUNT(customer_id)
0         1                 326
1         2                 273